app/views/business_profiles/index.html.erb


<h1>Business Profiles <%= "tagged with " + params[:tag] + "(" + @tag.taggings.count.to_s + ")" if params[:tag] %></h1>
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('learn to code'))
SELECT COUNT(*) FROM "taggings" WHERE "taggings"."tag_id" = ?  [["tag_id", 4]]