app/views/business_profiles/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "business_users" ON "users"."id" = "business_users"."user_id" WHERE "business_users"."business_profile_id" = ?  [["business_profile_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "business_users" ON "users"."id" = "business_users"."user_id" WHERE "business_users"."business_profile_id" = ?  [["business_profile_id", 1]]
---
  <strong>Head count:</strong>
  <%= @business_profile.users.count %>