app/controllers/business_profiles_controller.rb

  def join
    unless @business_profile.users.include?(current_user)
---
SELECT  1 AS one FROM "users" INNER JOIN "business_users" ON "users"."id" = "business_users"."user_id" WHERE "business_users"."business_profile_id" = ? AND "users"."id" = ? LIMIT 1  [["business_profile_id", 1], ["id", 3]]

  def index
    if params[:tag]
      @tag = ActsAsTaggableOn::Tag.find_by(name: params[:tag])
      @business_profiles = BusinessProfile.tagged_with(params[:tag])
    else
    @business_profiles = BusinessProfile.all
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT 1  [["name", "learn to code"]]
SELECT "business_profiles".* FROM "business_profiles" JOIN taggings business_pro_taggings_998a270  ON business_pro_taggings_998a270.taggable_id = business_profiles.id AND business_pro_taggings_998a270.taggable_type = 'BusinessProfile' AND business_pro_taggings_998a270.tag_id = 4

  def show
    @users = @business_profile.users
    @events = @business_profile.events.future_events.chron_order.limit(3)
---
SELECT "users".* FROM "users" INNER JOIN "business_users" ON "users"."id" = "business_users"."user_id" WHERE "business_users"."business_profile_id" = ?  [["business_profile_id", 1]]

  def create
    @business_profile = BusinessProfile.new(business_profile_params)
    @business_profile.users << current_user
---
INSERT INTO "business_profiles" ("name", "logo", "description", "head_count", "website_link", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @business_profile.slug = nil
    respond_to do |format|
      if @business_profile.update(business_profile_params)
---
UPDATE "business_profiles" SET "slug" = ?, "updated_at" = ? WHERE "business_profiles"."id" = ?  [["slug", "vargas-industries"], ["updated_at", "2015-07-04 03:41:10.493236"], ["id", 1]]

    def set_business_profile
      @business_profile = BusinessProfile.friendly.find(params[:id])
---
SELECT  "business_profiles".* FROM "business_profiles" WHERE "business_profiles"."id" = ? LIMIT 1  [["id", 1]]