app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "location", "slug", "user_id", "business_profile_id", "image", "contact_number", "event_link", "starts", "ends", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    @event.user = current_user

    respond_to do |format|
      if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_event
      @event = Event.friendly.find(params[:id])