app/controllers/home_controller.rb

SELECT "events".* FROM "events" WHERE (starts > '2015-07-11 01:22:48.367277')
---
  def index
  	@events = Event.future_events.chron_order.limit(3)