app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user = current_user

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "profile_pic", "phone", "bio", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @profile = current_user.profile
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "name" = ?, "profile_pic" = ?, "phone" = ?, "bio" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["name", "John Smith"], ["profile_pic", "z6vu4951rk1gc0qf5eat.jpg"], ["phone", "9494949"], ["bio", "Test"], ["updated_at", "2015-07-04 04:15:11.978922"], ["id", 5]]